# ViewId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewNode..::..ViewId Property
ViewNode Class See Also
---
The Id of the view element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId ViewId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
```

# See Also
ViewNode Class
Autodesk.Revit.DB Namespace